Homework/HW1-F21.tex
% Created 2021-08-16 Mon 10:51
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage[top=1in, bottom=1.in, left=1in, right=1in]{geometry}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[theorems, skins]{tcolorbox}
\usepackage[version=3]{mhchem}
\usepackage[numbers,super,sort&compress]{natbib}
\usepackage{natmove}
\usepackage{url}
\usepackage[cache=false]{minted}
\usepackage[strings]{underscore}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\usepackage{setspace}
\usepackage[left=1in, right=1in, top=1in, bottom=1in, nohead]{geometry}
\geometry{margin=1.0in}
\usepackage{hyperref}
\usepackage{amsmath}
\usepackage{graphicx}
\usepackage{epstopdf}
\usepackage{fancyhdr}
\pagestyle{fancy}
\fancyhf{}
\usepackage[labelfont=bf]{caption}
\usepackage{setspace}
\setlength{\headheight}{10.2pt}
\setlength{\headsep}{20pt}
\renewcommand{\headrulewidth}{0.5pt}
\renewcommand{\footrulewidth}{0.5pt}
\lfoot{\today}
\cfoot{\copyright\ 2021 W.\ F.\ Schneider}
\rfoot{\thepage}
\chead{\bf{Advanced Chemical Reaction Engineering (CBE 60546)\vspace{12pt}}}
\lhead{\bf{Homework 1}}
\rhead{\bf{Due September 1, 2021}}
\usepackage{titlesec}
\titlespacing*{\section}
{0pt}{0.6\baselineskip}{0.2\baselineskip}
\title{University of Notre Dame\\Advanced Chemical Engineering Thermodynamics\\(CBE 60553)}
\author{Prof. William F.\ Schneider}
\usepackage{siunitx}
\usepackage[version=3]{mhchem}
\def\dbar{{\mathchar'26\mkern-12mu d}}
\setcounter{secnumdepth}{3}
\author{William F. Schneider}
\date{\today}
\title{CBE 60546 Homework}
\begin{document}

\begin{OPTIONS}
\end{OPTIONS}

\noindent \textbf{Solve each problem on separate sheets of paper, and clearly indicate the problem number and your name on each.  Carefully and neatly document your answers.  You may use a mathematical solver like Jupyter/iPython. Use plotting software for all plots.}

\section{All in balance}
\label{sec:orgecd4bab}
\subsection{One way under consideration for removing harmful ``\ce{NO_x}'' (\ce{NO} + \ce{NO2}) from flue gas is the thermal deNOx process, in which \ce{NH3} is used to reduce the \ce{NO} to \ce{NO2}:}
\label{sec:org171e96b}

\begin{center}
\ce{ \_ NO(g) + \_ O2 (g) + \_ NH3(g) -> \_ N2 (g) + \_ H2O (g) }
\end{center}
\noindent The research lab has several gas tanks available to study this reaction, including one containg 2.0\% \ce{NO} in an \ce{N2} diluent, one containing 10\% \ce{O2} in an \ce{N2} diluent, and a bottle of 4\% anhydrous ammonia in \ce{N2}. You can assume all gases behave ideally.

\begin{enumerate}
\item Balance the thermal deNOx reaction, assuming each \ce{NH3} titrates one \ce{NO}.

\item What mass flow rates are necessary to create a stoichiometric mixture at \SI{1}{bar} total pressure, \SI{400}{\celsius}, and \SI{10}{l/s} total volumetric flow rate?

\item Plot the molar flow rates of all five gases as a function of reaction advancement.

\item Plot the total volumetric flow rate as a function of reaction advancement.
\end{enumerate}

\subsection{\ce{NH3} oxidation is an undesirable side-reaction of thermal deNOx:}
\label{sec:orgb0c937a}

\begin{center}
\ce{ \_ NH3(g) + \_ O2 (g)  -> \_ NO (g) + \_ H2O (g) }
\end{center}
\begin{enumerate}
\item Balance the \ce{NH3} oxidation reaction.

\item Under the stoichiometric conditions described above, the reactor generates \SI{0.036}{g/s} \ce{NO} and \SI{0.017}{g/s} \ce{NH3}. How effectively is the \ce{NH3} being used for thermal deNOx? (\emph{Hint:} What are the advancements of the two reactions?)
\end{enumerate}

\section{NOx, NOx, who's there?}
\label{sec:orgf06a8b0}
\subsection{A simpler and confounding reaction of \ce{NO} is it's oxidation to \ce{NO2}:}
\label{sec:org487fe00}
\begin{center}
\ce{ \_ NO(g) + \_ O2 (g)  -> \_ NO2 (g)}
\end{center}
\noindent You can assume all gases behave ideally under the conditions considered in this problem.

\begin{enumerate}
\item Determine  \(\Delta H^\circ (\SI{298}{K})\),  \(\Delta S^\circ (\SI{298}{K})\), \(\Delta G^\circ (\SI{298}{K})\), and  \(K_p (\SI{298}{K})\) for the NO oxidation reaction. Be sure to specify your source and the standard state.

\item Calculate the equilibrium partial pressure ratio of \ce{NO2} to \ce{NO} in the atmosphere near the surface of the earth. Assume the mixing ratio of \ce{O2} to be \(0.2\) and a temperature of \SI{25}{\celsius}.

\item From standard compilations and at \SI{1}{atm} standard state, \(\Delta H^\circ (\SI{250}{\celcius}) = \SI{-116.532}{\kJ\per\mol}\) and \(\Delta S^\circ (\SI{250}{\celcius}) = \SI{-152.179}{J\per\mol\per\kelvin}\).  Use the van't Hoff relationship to plot \(\Delta G^\circ (T)\) vs \(T\) from room temperature to \SI{1000}{C}. Add a point on your plot for the \(\Delta G^\circ (\SI{298}{K})\) you found from a tabulation.

\item NO oxidation is catalyzed over diesel oxidation catalysts (DOCs) on diesel vehicles. Plot the equilibrium conversion of \ce{NO} to \ce{NO2} vs \(T\) from room temperature to \SI{1000}{\celsius} for an isobaric \SI{1}{atm} reactor presented with 0.1\% \ce{NO} and 5\% \ce{O2}, and balance \ce{N2}.
\end{enumerate}
\end{document}